In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
from arsenal import colors
from bench.spider.interface import SpiderInterface
from IPython.display import HTML
from genparse import EOS

import nest_asyncio

nest_asyncio.apply()

In [3]:
spider = SpiderInterface()

In [4]:
# for x in spider.dev_data[:2]:
#    print()
#    print(x.text)
#    print(x.gold_sql)
#    print(x.db_name)

In [5]:
x = spider.dev_data[0]
assert x.evaluate(x.gold_sql)
x

In [6]:
x = spider.dev_data[1]
assert x.evaluate('SELECT count(*) FROM singer')
x

In [7]:
x.run_query('SELECT count(*) FROM singer')

   count(*)
0         6

In [8]:
from pathlib import Path

import bench.spider.evaluation as E
from bench.spider.evaluation import (
    # build_foreign_key_map_from_json,
    build_valid_col_units,
    rebuild_sql_val,
    rebuild_sql_col,
    eval_exec_match,
)


def evaluate(self, gold: str, pred: str, db_name: str):
    """Returns: bool, Optional[str]

    On success (i.e., predicted execution result is the same as gold), returns `(True, None)`
    On failure, returns `(False, reason)` where reason is one of the two cases:
    * `invalid` if `pred` sql is not a well-formed sql statement that can be parsed by sqlite
    * `mismatch` if `pred` is a well-formed sql but the execution result is different from that of the `gold`.
    """
    db = self.db_path / db_name / (db_name + '.sqlite')
    schema = E.Schema(E.get_schema(db))
    g_sql = E.get_sql(schema, gold)

    try:
        p_sql = E.get_sql(schema, pred)
    except Exception as e:
        # sql is ill-formed (can't be parsed by sqlite engine)
        print(
            colors.red % e.__class__.__name__,
            e,
        )

        import traceback

        traceback.print_exc()

        return False, 'invalid'

    kmap = self.kmaps[db_name]
    g_valid_col_units = build_valid_col_units(g_sql['from']['table_units'], schema)
    g_sql = rebuild_sql_val(g_sql)
    g_sql = rebuild_sql_col(g_valid_col_units, g_sql, kmap)
    p_valid_col_units = build_valid_col_units(p_sql['from']['table_units'], schema)
    p_sql = rebuild_sql_val(p_sql)
    p_sql = rebuild_sql_col(p_valid_col_units, p_sql, kmap)

    exec_match = eval_exec_match(db, pred, gold, p_sql, g_sql)
    reason = None if exec_match else 'mismatch'

    return exec_match, reason


# spider.evaluator = evaluate

In [9]:
# x.interface.evaluator = evaluate

In [10]:
x.interface.evaluator.evaluate = evaluate

In [11]:
junk_sql = 'select count(*) from sangerz'

In [12]:
x.interface.evaluator.evaluate(
    x.interface.evaluator, gold=x.gold_sql, pred=junk_sql, db_name=x.db_name
)

KeyError 'sangerz'

Traceback (most recent call last):
  File "/home/timv/tmp/ipykernel_361363/3253677207.py", line 26, in evaluate
    p_sql = E.get_sql(schema, pred)
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 618, in get_sql
    _, sql = parse_sql(toks, 0, tables_with_alias, schema)
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 562, in parse_sql
    from_end_idx, table_units, conds, default_tables = parse_from(
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 439, in parse_from
    idx, table_unit, table_name = parse_table_unit(
  File "/home/timv/projects/genparse/bench/spider/process_sql.py", line 289, in parse_table_unit
    key = tables_with_alias[toks[idx]]
KeyError: 'sangerz'

(False, 'invalid')

In [13]:
# x.db_schema.columns

In [14]:
grammar_text = open(
    '/home/timv/projects/genparse/benchmark/grammars/sql_case_insensitive.lark'
).read()

In [15]:
from genparse.util import InferenceSetupVLLM, InferenceSetup

In [16]:
# infer = InferenceSetup('codellama', grammar_text, proposal_name='character', guide_opts={'ignore': '\s*'})
infer = InferenceSetupVLLM(
    'codellama',
    grammar_text,
    proposal_name='character',
    guide_opts={'ignore': r'\s*'},
    batch_size=50,
)

INFO 06-30 15:13:32 config.py:1214] Upcasting torch.bfloat16 to torch.float32.
INFO 06-30 15:13:32 llm_engine.py:161] Initializing an LLM engine (v0.5.0.post1) with config: model='codellama/CodeLlama-7b-Instruct-hf', speculative_config=None, tokenizer='codellama/CodeLlama-7b-Instruct-hf', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, rope_scaling=None, rope_theta=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.float32, max_seq_len=4096, download_dir=None, load_format=LoadFormat.AUTO, tensor_parallel_size=1, disable_custom_all_reduce=False, quantization=None, enforce_eager=False, kv_cache_dtype=auto, quantization_param_path=None, device_config=cuda, decoding_config=DecodingConfig(guided_decoding_backend='outlines'), seed=0, served_model_name=codellama/CodeLlama-7b-Instruct-hf)
INFO 06-30 15:13:32 selector.py:136] Cannot use FlashAttention-2 backend for dtype other than torch.float16 or torch.bfloat16.
INFO 06-30 15:13:32 selector.py:51] Using XFormers backend.
INFO 06-30 15:13:34 selector.py:136] Cannot use FlashAttention-2 backend for dtype other than torch.float16 or torch.bfloat16.
INFO 06-30 15:13:34 selector.py:51] Using XFormers backend.
INFO 06-30 15:13:34 weight_utils.py:218] Using model weights format ['*.safetensors']
INFO 06-30 15:13:41 model_runner.py:160] Loading model weights took 25.1143 GB
INFO 06-30 15:13:43 gpu_executor.py:83] # GPU blocks: 605, # CPU blocks: 256
INFO 06-30 15:13:45 model_runner.py:889] Capturing the model for CUDA graphs. This may lead to unexpected consequences if the model is not static. To run the model in eager mode, set 'enforce_eager=True' or use '--enforce-eager' in the CLI.
INFO 06-30 15:13:45 model_runner.py:893] CUDA graphs can take additional 1~3 GiB memory per GPU. If you are running out of memory, consider decreasing `gpu_memory_utilization` or enforcing eager mode. You can also reduce the `max_num_seqs` as needed to decrease memory usage.
INFO 06-30 15:14:01 model_runner.py:965] Graph capturing finished in 17 secs.

In [17]:
x = spider.dev_data[2]
x

In [18]:
p = infer(x.describe(), n_particles=50, method='smc-standard', max_tokens=100)

In [19]:
# infer.proposal.timer.compare()
# infer.proposal.timer.plot_feature('t')

In [20]:
def show_posterior_tables(x, p):
    display(HTML(f'<h3>{x.text}</h3>'))
    for y, py in sorted(p.posterior.items(), key=lambda ab: -ab[1]):
        y = y[:-1]  # remove EOS
        print(f'{colors.mark(x.evaluate(y))} {py:-.6f} {y}')
        try:
            display(x.run_query(y))
        except Exception as e:
            print()
            print(colors.dark.red % 'ðŸ’€ ERROR', e)
            print()

In [21]:
show_posterior_tables(x, p)

âœ” 0.226781 select Name, country, age from singer order by age DESC

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.158746 select Name, Country, Age  from singer order by Age desc

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.136068 select Name, Country, Age from singer  order by Age desc

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.136068 select Name, country, age from singer order by age desc

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.136068 select Name, Country, Age from Singer

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1     Timbaland  United States   32
2  Justin Brown         France   29
3    Rose White         France   41
4  John Nizinik         France   43
5   Tribal King         France   25

âœ” 0.090712 select Name, Country, Age from singer order by Age DESC

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.045356 select Name, Country, Age from singer order by Age desc

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.022678 select Name, Country, Age from singer where Age in (select max(Age) from singer) order by Age desc

        Name      Country  Age
0  Joe Sharp  Netherlands   52

âœ˜ 0.022678 select Name AS "Name", Country AS "Country", Age AS "Age" FROM singer order by Age desc

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.022678 select Name AS "Name", Country AS "Country", Age AS "Age" FROM singer ORDER BY Age DESC

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.002034 select Name, Country, Age from singer where Age in (select max(Age) from singer) and Age in (select min(Age) from singer) order by Age desc

Empty DataFrame
Columns: [Name, Country, Age]
Index: []

âœ˜ 0.000084 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer x, singer_in_concert y where x.Age = (select max(Age) from singer)) order by 3 desc

        Name      Country  Age
0  Joe Sharp  Netherlands   52

âœ˜ 0.000044 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer x, singer_in_concert y where x.Singer_ID = y.Singer_ID) order by age desc limit 25

           Name        Country  Age
0  John Nizinik         France   43
1    Rose White         France   41
2     Timbaland  United States   32
3  Justin Brown         France   29
4   Tribal King         France   25

âœ˜ 0.000003 select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert where concert_ID in(select concert_ID from concert where Theme in ('Rock','Pop')))) order by Age desc limit 300

Empty DataFrame
Columns: [Name, Country, Age]
Index: []

âœ˜ 0.000001 select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert)) and Age in (select Min from singer where Singer_ID in(select Singer_ID from singer_in_concert) order by Age)

ðŸ’€ ERROR Execution failed on sql 'select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert)) and Age in (select Min from singer where Singer_ID in(select Singer_ID from singer_in_concert) order by Age)': no such column: Min

âœ˜ 0.000000 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer as x left join singer_in_concert as y on y.Singer_ID=x.Singer_ID group by x.Singer_ID HAVING max(y.Concert_ID)  over (partition by x.Singer_ID) = y.Concert_ID ) order by Age DESC

ðŸ’€ ERROR Execution failed on sql 'select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer as x left join singer_in_concert as y on y.Singer_ID=x.Singer_ID group by x.Singer_ID HAVING max(y.Concert_ID)  over (partition by x.Singer_ID) = y.Concert_ID ) order by Age DESC': misuse of window function max()

### Approximate Minimum Bayes Risk Decoding

In [22]:
x.gold_sql

'SELECT name ,  country ,  age FROM singer ORDER BY age DESC'

In [23]:
print(x.describe())

You are a coding assistant helping an analyst answer questions over business data in SQL.
More specifically, the analyst provides you a database schema
(tables in the database along with their column names and types)
and asks a question about the data that can be solved by issuing a SQL query to the database.
In response, you write the SQL statement that answers the question.
You do not provide any commentary or explanation of what the code does,
just the SQL statement ending in a semicolon.

Here is a database schema:

stadium
* Stadium_ID (number): stadium id
* Location (text): location
* Name (text): name
* Capacity (number): capacity
* Highest (number): highest
* Lowest (number): lowest
* Average (number): average

singer
* Singer_ID (number): singer id
* Name (text): name
* Country (text): country
* Song_Name (text): song name
* Song_release_year (text): song release year
* Age (number): age
* Is_male (others): is male

concert
* concert_ID (number): concert id
* concert_Name (text): concert name
* Theme (text): theme
* Stadium_ID (text): stadium id
* Year (text): year

singer_in_concert
* concert_ID (number): concert id
* Singer_ID (text): singer id

Please write me a SQL statement that answers the following question: Show name, country, age for all singers ordered by age from the oldest to the youngest.

Remember, DO NOT provide any commentary or explanation of what the code does, just the SQL statement ending in a semicolon.

In [27]:
def EVAL(x, y1, y2):
    if y1.endswith(EOS):
        y1 = y1[:-1]
    if y2.endswith(EOS):
        y2 = y2[:-1]
    try:
        return x.interface.evaluate(y1, y2, x.db_name)[0]
    except Exception:
        #        print(e)
        return False

In [30]:
def show_mbr_tables(x, particles):
    display(HTML(f'<h3>{x.text}</h3>'))
    risks = {
        candidate: particles.risk(lambda y1, y2: EVAL(x, y1, y2), candidate)
        for candidate in particles.posterior
    }
    for candidate in sorted(risks, key=risks.__getitem__, reverse=True):
        print(
            colors.mark(
                x.evaluate(candidate[:-1] if candidate.endswith(EOS) else candidate)
            ),
            f'{risks[candidate]:f}',
            (colors.dark.magenta if risks[candidate] == 0 else colors.light.magenta)
            % candidate,
        )
        try:
            display(x.run_query(candidate[:-1] if candidate.endswith(EOS) else candidate))
        except Exception as e:
            print()
            print(colors.dark.red % 'ðŸ’€ ERROR', e)
            print()

In [31]:
show_mbr_tables(x, p)

âœ” 0.793732 select Name, Country, Age  from singer order by Age descâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.793732 select Name, Country, Age from singer  order by Age descâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.793732 select Name, Country, Age from singer order by Age DESCâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.793732 select Name, Country, Age from singer order by Age descâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.793732 select Name, country, age from singer order by age descâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ” 0.793732 select Name, country, age from singer order by age DESCâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.136068 select Name, Country, Age from Singer â–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1     Timbaland  United States   32
2  Justin Brown         France   29
3    Rose White         France   41
4  John Nizinik         France   43
5   Tribal King         France   25

âœ˜ 0.022678 select Name, Country, Age from singer where Age in (select max(Age) from singer) order by Age descâ–ª

        Name      Country  Age
0  Joe Sharp  Netherlands   52

âœ˜ 0.002034 select Name, Country, Age from singer where Age in (select max(Age) from singer) and Age in (select min(Age) from singer) order by Age descâ–ª

Empty DataFrame
Columns: [Name, Country, Age]
Index: []

âœ˜ 0.000000 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer x, singer_in_concert y where x.Age = (select max(Age) from singer)) order by 3 desc â–ª

        Name      Country  Age
0  Joe Sharp  Netherlands   52

âœ˜ 0.000000 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer as x left join singer_in_concert as y on y.Singer_ID=x.Singer_ID group by x.Singer_ID HAVING max(y.Concert_ID)  over (partition by x.Singer_ID) = y.Concert_ID ) order by Age DESCâ–ª

ðŸ’€ ERROR Execution failed on sql 'select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer as x left join singer_in_concert as y on y.Singer_ID=x.Singer_ID group by x.Singer_ID HAVING max(y.Concert_ID)  over (partition by x.Singer_ID) = y.Concert_ID ) order by Age DESC': misuse of window function max()

âœ˜ 0.000000 select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert where concert_ID in(select concert_ID from concert where Theme in ('Rock','Pop')))) order by Age desc limit 300â–ª

Empty DataFrame
Columns: [Name, Country, Age]
Index: []

âœ˜ 0.000000 select Name AS "Name", Country AS "Country", Age AS "Age" FROM singer order by Age descâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.000000 select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert)) and Age in (select Min from singer where Singer_ID in(select Singer_ID from singer_in_concert) order by Age)â–ª

ðŸ’€ ERROR Execution failed on sql 'select Name, Country, Age from singer where Age in (select max(Age) from singer where Singer_ID in(select Singer_ID from singer_in_concert)) and Age in (select Min from singer where Singer_ID in(select Singer_ID from singer_in_concert) order by Age)': no such column: Min

âœ˜ 0.000000 select Name AS "Name", Country AS "Country", Age AS "Age" FROM singer ORDER BY Age DESCâ–ª

           Name        Country  Age
0     Joe Sharp    Netherlands   52
1  John Nizinik         France   43
2    Rose White         France   41
3     Timbaland  United States   32
4  Justin Brown         France   29
5   Tribal King         France   25

âœ˜ 0.000000 select Name, Country, Age from singer where Singer_ID in (select x.Singer_ID from singer x, singer_in_concert y where x.Singer_ID = y.Singer_ID) order by age desc limit 25â–ª

           Name        Country  Age
0  John Nizinik         France   43
1    Rose White         France   41
2     Timbaland  United States   32
3  Justin Brown         France   29
4   Tribal King         France   25